testbusters/evil-performance-testing/jmeter/reports/closed-model/statistics.json
{
  "Send Transaction" : {
    "transaction" : "Send Transaction",
    "sampleCount" : 48199,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 38.682649017614466,
    "medianResTime" : 15.0,
    "minResTime" : 10.0,
    "maxResTime" : 10013.0,
    "pct1ResTime" : 16.0,
    "pct2ResTime" : 17.0,
    "pct3ResTime" : 19.0,
    "throughput" : 80.42871731889814,
    "receivedKBytesPerSec" : 15.136291802525047,
    "sentKBytesPerSec" : 39.50746563613844
  },
  "Debug/Teardown" : {
    "transaction" : "Debug/Teardown",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 14.0,
    "medianResTime" : 14.0,
    "minResTime" : 14.0,
    "maxResTime" : 14.0,
    "pct1ResTime" : 14.0,
    "pct2ResTime" : 14.0,
    "pct3ResTime" : 14.0,
    "throughput" : 71.42857142857143,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 48201,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 38.687745067529534,
    "medianResTime" : 15.0,
    "minResTime" : 10.0,
    "maxResTime" : 10013.0,
    "pct1ResTime" : 16.0,
    "pct2ResTime" : 17.0,
    "pct3ResTime" : 19.0,
    "throughput" : 80.28950261518473,
    "receivedKBytesPerSec" : 15.109465313405735,
    "sentKBytesPerSec" : 39.437445408539325
  },
  "Debug/Configuration" : {
    "transaction" : "Debug/Configuration",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 309.0,
    "medianResTime" : 309.0,
    "minResTime" : 309.0,
    "maxResTime" : 309.0,
    "pct1ResTime" : 309.0,
    "pct2ResTime" : 309.0,
    "pct3ResTime" : 309.0,
    "throughput" : 3.236245954692557,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  }
}