testbusters/evil-performance-testing/jmeter/reports/open-model/statistics.json
{
  "Send Transaction" : {
    "transaction" : "Send Transaction",
    "sampleCount" : 23992,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1011.1440896965635,
    "medianResTime" : 14.0,
    "minResTime" : 10.0,
    "maxResTime" : 10019.0,
    "pct1ResTime" : 5017.700000000004,
    "pct2ResTime" : 8005.0,
    "pct3ResTime" : 10005.0,
    "throughput" : 40.242474663947156,
    "receivedKBytesPerSec" : 7.584763291154102,
    "sentKBytesPerSec" : 19.76754370699748
  },
  "Debug/Teardown" : {
    "transaction" : "Debug/Teardown",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.0,
    "medianResTime" : 6.0,
    "minResTime" : 6.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 6.0,
    "throughput" : 166.66666666666666,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 23994,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1011.072851546218,
    "medianResTime" : 14.0,
    "minResTime" : 6.0,
    "maxResTime" : 10019.0,
    "pct1ResTime" : 5017.700000000004,
    "pct2ResTime" : 8005.0,
    "pct3ResTime" : 10005.0,
    "throughput" : 39.999066455063144,
    "receivedKBytesPerSec" : 7.5382581510142295,
    "sentKBytesPerSec" : 19.646341191503407
  },
  "Debug/Configuration" : {
    "transaction" : "Debug/Configuration",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 307.0,
    "medianResTime" : 307.0,
    "minResTime" : 307.0,
    "maxResTime" : 307.0,
    "pct1ResTime" : 307.0,
    "pct2ResTime" : 307.0,
    "pct3ResTime" : 307.0,
    "throughput" : 3.257328990228013,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  }
}